jonacappelle/nRF52-DCU/main.c
typedef enum
{
    CMD_TYPE,
    CMD_FREQ,
} cmd_received_t;

#define CMD_GYRO 0x67  //g
#define CMD_ACCEL 0x61 //a
#define CMD_MAG 0x6D   //m

#define CMD_QUAT 0x71  //q
#define CMD_QUAT6 0x36 //6
#define CMD_QUAT9 0x39 //9

#define CMD_EULER 0x65 //e

#define CMD_CR 0x0A //carriage return

#define CMD_FREQ 0x66 //f

#define CMD_FREQ_LEN 3 // Length of the frequency component of uart config
#define CMD_FREQ_10 10
#define CMD_FREQ_50 50
#define CMD_FREQ_100 100
#define CMD_FREQ_225 225
#define CMD_FREQ_200 200

#define CMD_PRINT 0x68    //h
#define CMD_SETTINGS 0x70 //p
#define CMD_RESET 0x72    //r
#define CMD_SEND 0x73     //s

#define CMD_WOM 0x77 //w

#define CMD_SYNC 0x69         //i
#define CMD_SYNC_ENABLE 0x31  //1
#define CMD_SYNC_DISABLE 0x30 //0

#define CMD_STOP 0x74 //t

#define CMD_ADC 0x64 //d

#define CMD_LIST 0x6c //l


static uint32_t usr_get_fifo_len(app_fifo_t * p_fifo)
{
    uint32_t tmp = p_fifo->read_pos;
    return p_fifo->write_pos - tmp;
}


ret_code_t config_send(IMU *imu)
{
    ret_code_t err_code;

    ble_tes_config_t config;
    config.gyro_enabled = imu->gyro_enabled;
    config.accel_enabled = imu->accel_enabled;
    config.mag_enabled = imu->mag_enabled;
    config.euler_enabled = imu->euler_enabled;
    config.quat6_enabled = imu->quat6_enabled;
    config.quat9_enabled = imu->quat9_enabled;
    config.motion_freq_hz = imu->frequency;
    config.wom_enabled = imu->wom;
    config.sync_enabled = imu->sync_enabled;
    config.stop = imu->stop;
    config.adc_enabled = imu->adc;

    // Get timestamp from master
    imu->sync_start_time = ts_timestamp_get_ticks_u64();

    // Send start signal to be 2 seconds later
    imu->sync_start_time = ( TIME_SYNC_TIMESTAMP_TO_USEC(imu->sync_start_time) / 1000 ) + 2000;

    imu->sync_start_time = ( TIME_SYNC_MSEC_TO_TICK(imu->sync_start_time) / 100 ) * 100;


    config.sync_start_time = imu->sync_start_time;
    NRF_LOG_INFO("sync_start_time: %d", imu->sync_start_time);
    

    NRF_LOG_INFO("config.adc_enabled %d", config.adc_enabled);

    // Send config to peripheral
    for (uint8_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        // do
        // {
        err_code = ble_tes_config_set(&m_thingy_tes_c[i], &config);
        // if(err_code != NRF_SUCCESS)
        // {
        //     NRF_LOG_INFO("ble_tes_config_set error %d", err_code);
        // }
        NRF_LOG_INFO("ble_tes_config_set error %d", err_code);
        // }while(err_code == NRF_ERROR_RESOURCES);
    }
    return err_code;
}

void config_reset(IMU *imu)
{
    imu->gyro_enabled = 0;
    imu->accel_enabled = 0;
    imu->mag_enabled = 0;
    imu->quat6_enabled = 0;
    imu->quat9_enabled = 0;
    imu->euler_enabled = 0;
    imu->frequency = 0;
    imu->sync_enabled = 0;
    imu->stop = 0;
    imu->adc = 0;
}



static void ble_send_config(ble_tes_config_t * stop_config)
{
    ret_code_t err_code;

    // Send config to peripheral
    for (uint8_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        err_code = ble_tes_config_set(&m_thingy_tes_c[i], &stop_config);
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_INFO("ble_tes_config_set error %d", err_code);
        }
    }
}



void uart_rx_scheduled(void *p_event_data, uint16_t event_size)
{
    NRF_LOG_INFO("uart_rx_scheduled");

    uint8_t state = CMD_TYPE;

    ret_code_t err_code;

    uint8_t p_byte[3];

    // If there is data left in FIFO and the read byte is not a carriage return
    while ((uart_rx_buff_get(p_byte) != NRF_ERROR_NOT_FOUND))
    {
        NRF_LOG_INFO("FIFO get");

        // Check if end of message is reached
        if (p_byte[0] == CMD_CR)
        {
            NRF_LOG_INFO("Break!");
            // NRF_LOG_FLUSH();
            break;
        }
        // Here we can process the request received over UART

        NRF_LOG_INFO("p_byte: %d - %s", p_byte[0], p_byte[0]);
        // NRF_LOG_FLUSH();

        switch (p_byte[0])
        {
        case CMD_PRINT:
            NRF_LOG_INFO("CMD_PRINT received");

            uart_print("------------------------------------------\n");
            uart_print("-----  NOMADE WIRELESS SENSOR NODE   -----\n");
            uart_print("------------------------------------------\n");
            // uart_print("\n");
            uart_print("Press:  'h' for help\n");
            uart_print("Press:  's' to show current settings\n");
            uart_print("Press:  '1' to set up sync\n");
            uart_print("Press:  'g' to enable gyroscope\n");
            uart_print("Press:  'a' to enable accelerometer\n");
            uart_print("Press:  'm' to enable magnetometer\n");
            uart_print("Press:  'e' to enable euler angles\n");
            uart_print("Press:  'q6' to enable 6 DoF quaternions\n");
            uart_print("Press:  'q9' to enable 9 DoF quaternions\n");
            uart_print("Press:  't' to stop sampling\n");
            uart_print("------------------------------------------\n");
            uart_print("Press:  'f' + '3 digital number' to set sampling frequency\n");
            uart_print("------------------------------------------\n");
            uart_print("Example:    q6f225  Enable 6 DoF Quaternions with sampling rate of 225 Hz\n");
            uart_print("------------------------------------------\n");
            break;

        case CMD_SETTINGS:
            NRF_LOG_INFO("CMD_SETTINGS received");

            uart_print("------------------------------------------\n");
            uart_print("Current settings:\n");
            if (imu.gyro_enabled)
                uart_print("---    Gyroscope enabled\n");
            if (imu.accel_enabled)
                uart_print("---   Accelerometer enabled\n");
            if (imu.mag_enabled)
                uart_print("--- Magnetometer enabled\n");
            if (imu.euler_enabled)
                uart_print("---   Euler angles enabled\n");
            if (imu.quat6_enabled)
                uart_print("---   Quaternions 6 DoF enabled\n");
            if (imu.quat9_enabled)
                uart_print("---   Quaternions 9 DoF enabled\n");
            if (imu.frequency != 0)
            {
                uart_print("---  Sensor frequency:  ");
                char str[5];
                sprintf(str, "%d Hz\n", imu.frequency);
                NRF_LOG_INFO("string: %s", str);
                uart_print(str);
            }
            if (imu.adc)
                uart_print("---   ADC enabled\n");
            if (imu.sync_enabled)
                uart_print("---   Synchonization enabled\n");
            uart_print("------------------------------------------\n");
            break;

        case CMD_LIST:
            NRF_LOG_INFO("CMD_LIST received");

            uart_print("------------------------------------------\n");
            uart_print("Connected devices list:\n");

