jonacappelle/nRF52-DCU/main.c
static void scheduler_init()
{
    // Application scheduler (soft interrupt like)
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

static void services_init()
{
    // BLE NUS Service
    nus_c_init();

    // Motion Service
    thingy_tes_c_init();

    // TODO: add Battery Service

}

static void buffers_init()
{
    ret_code_t err_code;

    // // Initialize FIFO structure for collecting received data
    err_code = app_fifo_init(&buffer.received_data_fifo, buffer.received_data_buffer, (uint16_t)sizeof(buffer.received_data_buffer));
    APP_ERROR_CHECK(err_code);
}


int main(void)
{
    ret_code_t err_code;

    // Initialize.
    log_init();
    timer_init();
    //    uart_init();

    // A better UART driver than nrf_uart_drv - asynchronous with DMA and QUEUE
    libuarte_init(uart_rx_scheduled);

    // uart_dma_init();

    // Initialize buffers
    buffers_init();

    // Application scheduler (soft interrupt like)
    scheduler_init();

    buttons_leds_init();


    db_discovery_init();
    power_management_init();
    ble_stack_init();
    
    // Not needed - by setting correct settings in sdk_config.h this will be enabled
    // conn_evt_len_ext_set(); // added for faster speed

    gatt_init();

    // Initialize BLE services
    services_init();


    // Reset BLE connection state
    /* CHANGES ADDED */
    ble_conn_state_init();
    /* END ADDED CHANGES */

    // Init scanning for devices with NUS service + start scanning
    scan_init();
    scan_start();

    // TimeSync
    // Start TimeSync AFTER scan_start()
    // This is a temporary fix for a known bug where connection is constantly closed with error code 0x3E
    sync_timer_init();

    // Initialize pins for debugging
    usr_gpio_init();

    // Enter main loop.
    for (;;)
    {
        // App scheduler: handle event in buffer
        app_sched_execute();

        // RTT Logging
        NRF_LOG_FLUSH();

        // Run power management
        idle_state_handle();

        // Toggle pin to check CPU activity
        // check_cpu_activity();
    }
}
